Techposts/smartghar-smart-switch/firmware/sdkconfig.defaults
# SmartGhar Smart Switch — ESP32-C6
CONFIG_IDF_TARGET="esp32c6"

# ESP-NOW rides on WiFi STA. Power-save OFF so ESP-NOW RX is never missed (the
# switch is mains-powered, so always-on radio costs nothing).
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=n

# Smaller log level for production; bump for bring-up.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Single-app partition is fine for v0.1.0 (OTA partitioning added later).
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# Route the console to the native USB Serial/JTAG so logs appear over the XIAO's
# USB port (default on C6 is UART0, which isn't broken out to USB on the XIAO).
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
